const worldMapData = [
  {
    id: "north-america",
    message:
      " أمريكا الشمالية (الولايات المتحدة وكندا) اكتشاف الشيخ للتحديات والفرص التي يواجهها المسلمون في الغرب.",
  },
  {
    id: "brazil",
    message:
      "البرازيل التجربة البرازيلية: أعجب الشيخ العبودي بشدة بلطف الشعب البرازيلي وحسن تعاملهم مع الأجانب.المؤتمر الإسلامي في البرازيل (1970): شارك الشيخ في المؤتمر الهام الذي كان علامة تحول في تاريخ الدعوة الإسلامية بالبرازيل.",
  },
  {
    id: "arctic-ocean",
    message:
      "المحيط المتجمد الشمالي أدفأ يوم في المحيط المتجمد: لاحظ الشيخ أن أدفأ يوم في المحيط المتجمد الشمالي هو 22 يوليو بدرجة حرارة 3 درجات..",
  },
  {
    id: "africa",
    message:
      "أفريقيا  في أفريقيا الخضراء: أمضى الشيخ محمد ورفاقه حوالي ثلاثة أشهر في أفريقيا، مما أدى إلى تأليف كتابه في إفريقية الخضراء. أفريقيا - المتعة والغرابة: وصف الشيخ رحلاته إلى أفريقيا بأنها كانت مليئة بالمفاجآت والغرابة",
  },
  {
    id: "burundi",
    message:
      " بوز مبورا، بورندي حادثة فقدان الحقيبة في المطار: الشيخ محمد ومرافقه عبد الله الباحوث فقدا حقيبة في المطار، وأخبرهم موظف الجمرك بالعودة يوم الاثنين بسبب العطلة. لم يذكر العثور على الحقيبة، مع إشارة إلى سرقة البضائع من المطار..",
  },
  {
    id: "tanzania",
    message:
      "تنزانيا مشاهدات جبل كليمنجارو: رأى الشيخ ورفاقه جبل كليمنجارو، الأعلى في أفريقيا، من الطائرة بعد مغادرة مطار نيروبي .",
  },
  {
    id: "indian",
    message:
      "الهند الشيخ يتأمل التنوع الديني والثقافي في الهند، ويلاحظ تعايش الديانات المختلفة.",
  },
  {
    id: "astralia",
    message:
      "أستراليا زيارة الشيخ لمجتمعات المسلمين في أستراليا وإعجابه بتنوعها الثقافي وحفاظها على الهوية الإسلامية.",
  },
  {
    id: "japan",
    message:
      "اليابان اكتشاف الشيخ لوجود مسلمين في اليابان وتفاجئه بالجاليات الإسلامية المزدهرة في بلد مثل اليابان..",
  },
  {
    id: "bologna",
    message:
      " بولونيا في بولونيا قابل الشيخ العبودي الكثيرين من المسلمين في هذا البلد وكانوا يمارسون عباداتهم لكنها بطريقة عجيبة وغريبة، فقد كان إمامهم لا يعلم عدد ركعات صلاة الظهر وكان يصلي بالمسلمين هناك ركعتين..",
  },
  {
    id: "siberia",
    message:
      " سيبيريا سيبيريا وصلاة الجمعة الشهرية: في سيبيريا، وجد الشيخ أن المسلمين يصلون صلاة الجمعة مرة واحدة في الشهر وأن الشمس لا تغيب حتى بعد صلاة العشاء.",
  },
];
const saudiaMapData = [
  {
    id: "sabt-alia",
    message:
      "على بعد ٣٣٨ كيلًا من الطائف ونحو من ١١٨ كيلًا من الباحة جنوبًا،  وصلت إلى بلدة العلايا، مدينة صغيرة على ظهر السراة، تحيط بها     المرتفعات الجميلة، وحركة العمران فيها نشطة، وهي مركز إداري      به إمارة ومحكمة ومدارس للبنين والبنات، وجوها جميل جدًا، تعتبر    من المصائف الجميلة في بلادنا، فقد مررت فيها في عز الظهيرة،      وفي فصل القيظ، فلم أشعر إلا ببرودة الربعية.",
  },
  {
    id: "elnmas",
    message:
      " وقبل أبها بمائة وسبعين كيلًا وصلنا النماص: قاعدة بني شهر وبني عمرو من آل حجر أو رجال الحجر كما يقولون، وهي مدينة متقدمة في فسيح من الأرض بها جميع الدوائر الحكومية التي توجد في المدن، ويقول عمرو بن غرامة العمري في كتابه (بلاد رجال الحجر): ان اسم النماص كان القرية ثم أطلق على هذا الاسم لكثرة نبات الحلفاء في واديها، وأهل السراة يسمون الحلفاء النمص.  وجو النماص جميل وجبالها خضر، وترتفع عن سطح البحر ٢٢٠٠ مترًا ولها سوق أسبوعي يوم الثلاثاء ومعظم مدن السراة تكون أساسًا  أسواق أسبوعية ثم تتطور إلى المدن. ",
  },
  {
    id: "abha",
    message:
      "جميع رسومها التي مرت بي تكتب بالألف الطويلة، كذا (أبها). غير  أن أستاذنا العلامة الباحث اللغوي: عبدالقدوس الأنصاري، يرى أن  اسمها بالألف اللينة، كذا (أبهى) بمعنى أفعل التفضيل من البهاء،  وهي بهية حقًا. ثم رأيت الملك عبدلله بن الحسين كتبها في  مذكراته (أبَهى) وهو ذو حذق في اللغة وتمكن.",
  },
  {
    id: "khamis-meshait",
    message:
      " كان سبب التسمية يرجع بأنها كانت سوقًا في بلاد شهران يقام كل يوم خميس، وهذه السراة لا زالت تستعمل أسواق الوعد، فتجد سوق السبت، وسوق الأحد… وغيرهم. ",
  },
  {
    id: "elwadiaa",
    message:
      "ولما كنا عند أحد الشيوخ في شرورة أبدينا للشيخ رغبتنا في زيارة  مصندقة ومكيفة يقودها السائق GMC الوديعة فأمر لنا بسيارة  مقبل بن محمد الصيعري، وقال الشيخ هذه سيارتي الخاصة ولما قلنا  له أن سيارتنا يمكن أن تقوم بالمهمة، قال مبتسمًا: سيارتكم انتهى  عملها هنا وأنتم في ضيافتنا وكلنا في خدمتكم، فشكرناه وتوجهنا  مع مقبل على طريق الوديعة باتجاه الجنوب الغربي، ولم نسر بضع أكيال حتى أحسسنا بارتجاج في السيارة فتوقف السائق وتفقد السيارة فإذا إحدى عجلاتها قد بنشرت وكانت الشمس قد اشتدت حرارتها وزاد من وهجها وجود الإسفلت والرمال البيض المحيطة، وبدّل مقبل العجلة بسرعة جيدة.",
  },
  {
    id: "ngran",
    message:
      "عندما رجعت إلى تاريخ نجران المدوّن فوجئت بضخامته، مع إيماني بأن المدوّن منه أقل من الحدّ الأدنى.. وأجزم أن تأريخ نجران لو استُقصي لملأ المجلدات ضخامةً.",
  },
  {
    id: "migration-road",
    message:
      "وقارئ كتابي (على طريق الهجرة) سيستفيد كثيرًا لو عطف على كتاب الأستاذ عبدالقدوس الأنصاري (طريق الهجرة النبوية) فهما متمّمان لبعضهما، جغرافيةً وتاريخًا، في كل ما يتعلق بالهجرة النبوية الشريفة و درب الأنبياء.",
  },
];

const popup = document.getElementById("popup");
const popupMessage = document.getElementById("popup-message");
document.addEventListener("click", hidePopup);

worldMapData.forEach((item) => {
  const textElement = document.getElementById(item.id);
  if (textElement) {
    textElement.addEventListener("click", (event) =>
      showPopup(event, item.message)
    );
  }
});

saudiaMapData.forEach((item) => {
  const textElement = document.getElementById(item.id);
  if (textElement) {
    textElement.addEventListener("click", (event) =>
      showPopup(event, item.message)
    );
  }
});
function showPopup(event, message) {
  const offsetX = -180;
  const offsetY = -200;

  const mouseX = event.clientX + window.pageXOffset;
  const mouseY = event.clientY + window.pageYOffset;

  popupMessage.textContent = message;
  popup.style.left = mouseX + offsetX + "px";
  popup.style.top = mouseY + offsetY + "px";
  popup.style.display = "block";
  event.stopPropagation();
}

function hidePopup() {
  popup.style.display = "none";
}
